#!/usr/bin/env python
# encoding: utf-8  

""" 

File Name: 深浅拷贝.py

Created by 彭思聪 on 2017/11/23 下午8:58.
Copyright © 2017年 彭思聪. All rights reserved.

"""

# import copy


"""  直接拷贝
l = [1, [2, 3]]
lc = l           # 直接赋值，------>>>  l 与 lc 其实保存的是列表的地址，是同一个值
lc[0] = 100
print(l, lc)    # 输出：[100, [2, 3]] [100, [2, 3]]
"""

''' 浅拷贝
l = [1, [2, 3]]
lc = l.copy()   # 只拷贝第一层, --------->>> 重新开辟一段内存给l的列表，并将列表的地址赋值给lc
lc[0] = 100     # 修改第一层， 二者不同
print(l, lc)    # 输出：[1, [2, 3]] [100, [2, 3]]
'''

""" 浅拷贝
l = [1, [2, 3]]
lc = l.copy()   # 只拷贝第一层, --------->>> 重新开辟一段内存给l的列表，并将列表的地址赋值给lc
lc[1][0] = 200     # 修改第二层，二者相同
print(l, lc)    # 输出：[1, [200, 3]] [1, [200, 3]]
"""

""" 深拷贝
l = [1, [2, 3]]
lc = copy.deepcopy(l)   #深拷贝， 全部拷贝
lc[1][0] = 200     # 只修改lc，二者不同
print(l, lc)    # 输出：[1, [2, 3]] [1, [200, 3]]]
"""
